cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/homebrew-php'

brew 'coreutils'
brew 'findutils'
brew 'moreutils'
brew 'go'
brew 'grc'
brew 'openssl'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'tree'
brew 'git'
brew 'grep'
brew 'bash'
brew 'bash-completion'
brew 'vim'
brew 'zsh'
brew 'zsh-completions'

# Utilites
cask '1password'
cask 'gas-mask'
cask 'alfred'
cask 'bartender'
cask 'appcleaner'
cask 'flux'
cask 'daisydisk'
cask 'teamviewer'
cask 'iterm2'
cask '1password'

# Media
cask 'spotify'
cask 'telegram'

# Web dev
cask 'firefox'
cask 'google-chrome'
cask 'sequel-pro'
cask 'postman'
cask 'docker'
brew 'php71'
brew 'php71-intl'
brew 'php71-imagick'
brew 'mariadb'

# Video
cask 'handbrake'
cask 'makemkv'
